{"extracted_information": "Система зачарований в Minecraft основана на столе зачарований, который использует опыт игрока и лазурит для наложения улучшений на предметы. Эффективность зачарований значительно повышается за счет окружающих книжных полок.", "specifications": {}, "pricing": {"lapis_lazuli_cost": "1-3 единицы лазурита за зачарование", "level_cost": "Количество уровней опыта, равное количеству использованного лазурита (например, 3 уровня за 3 лазурита). Игрок должен иметь как минимум уровень, требуемый для выбранного зачарования."}, "features": [{"name": "Как работает стол зачарований", "description": "Стол зачарований используется для наложения чар на инструменты, оружие, броню и книги. Для зачарования необходимо поместить предмет в соответствующий слот и 1-3 единицы лазурита. В GUI отображаются три псевдослучайных варианта зачарований. Глифы (руны) являются чисто косметическими и не влияют на зачарование. Наведение курсора на вариант показывает одно из возможных зачарований. Доступные варианты зачарований зависят от текущего уровня игрока и количества лазурита. Фактическая стоимость в уровнях и количество лазурита не влияют на силу зачарования, но влияют на то, какие зачарования могут появиться. Уровень зачарования, который игрок оплачивает, равен количеству использованного лазурита (например, для зачарования 30-го уровня может потребоваться 30 уровней у игрока, но будет оплачено всего 3 уровня и 3 лазурита). Требуемый уровень зачарования влияет на количество, тип и силу наложенных чар, при этом более высокий уровень зачарования обычно приводит к большему количеству и/или более мощным чарам. Однако присутствует значительный случайный фактор, и даже зачарование 30-го уровня не гарантирует более одного зачарования или их максимальной силы."}, {"name": "Влияние книжных полок (библиотек)", "description": "Книжные полки, расположенные вокруг стола зачарований, увеличивают максимальный уровень зачарований. Для достижения максимального 30-го уровня зачарования требуется 15 книжных полок. Книжные полки должны быть расположены на расстоянии одного блока воздуха от стола зачарований; любой блок (даже прозрачный, например факел) между столом и полками блокирует их связь."}, {"name": "Роль лазурита", "description": "Лазурит является обязательным компонентом для зачарования предметов. От 1 до 3 единиц лазурита расходуются за каждое зачарование. Количество потраченного лазурита также определяет количество уровней опыта, которое будет списано с игрока."}], "statistics": {"max_enchantment_level": 30, "bookshelves_for_max_level": 15}, "temporal_info": {"lapis_lazuli_introduction": "Введен в Java Edition 1.8 (снапшот 14w02a) как вторичная стоимость зачарования.", "max_level_change": "Максимальная сила зачарования была снижена с 50 до 30 в Java Edition 1.3.1 (снапшот 12w22a)."}, "geographical_data": {}, "references": []}