{"extracted_information": "В Minecraft система здоровья представлена сердечками над панелью быстрого доступа. Изначально игрок имеет 10 сердечек, что соответствует 20 очкам здоровья (каждое сердце равно 2 очкам). Полностью красные сердца означают максимальное здоровье. Потеря здоровья может привести к невозможности бегать (после потери 4 сердец) и, в конечном итоге, к смерти с потерей инвентаря. В режиме «Хардкор» смерть окончательна.", "specifications": {"hearts_to_health_points_ratio": "1 сердце = 2 очка здоровья", "initial_health_points": 20, "initial_hearts": 10, "hunger_bar_units": "10 куриных ножек", "oxygen_bar_units": "10 пузырьков"}, "pricing": {}, "features": [{"name": "Восстановление здоровья", "methods": [{"type": "Еда", "details": "Основной способ восстановления здоровья. Автоматическое восстановление начинается, когда уровень голода (куриные ножки) составляет 9 или более."}, {"type": "Зелье лечения", "details": "Мгновенно восстанавливает 4 сердца (8 очков здоровья).", "crafting_recipe": {"components": ["Варочная стойка", "3 колбы с водой", "Огненный порошок", "Нарост Нижнего мира", "Сочный ломтик арбуза"], "steps": ["Открыть варочную стойку", "Добавить огненный порошок для активации", "Поместить колбы с водой в соответствующие ячейки", "Добавить нарост Нижнего мира в верхнюю ячейку", "Добавить сочный ломтик арбуза", "Опционально: добавить пыль светокамня для Зелья лечения II"]}}]}, {"name": "Потеря здоровья", "causes": [{"type": "Длительное погружение под воду (утопление)", "details": "Кислородные пузырьки (10 штук) уменьшаются под водой. Здоровье начинает быстро уменьшаться после их исчезновения."}, {"type": "Недоедание (голод)", "details": "Шкала голода (10 куриных ножек) уменьшается при физических нагрузках. Здоровье начинает уменьшаться, когда шкала голода пуста."}, {"type": "Получение урона", "details": "От укусов пчел, ударов молнии, прикосновения к магме, падений с высоты, удушения гравием, горения, отравления (например, гнилой плотью), атак враждебных мобов. Количество урона зависит от источника и условий (например, высота падения)."}]}, {"name": "Избегание потери здоровья", "methods": ["Игра в творческом режиме (враждебные мобы не наносят урон)", "Игра на мирном уровне сложности (враждебные мобы безвредны)", "Бегство от опасности (двойное нажатие клавиши W)", "Не выходить наружу ночью", {"type": "Использование брони", "details": "Снижает получаемый урон. Уровень защиты зависит от части брони и материала.", "parts": ["Шлем", "Кираса", "Поножи", "Ботинки"], "materials_protection_level": "от худшего к лучшему: коровья шкура, незерит"}]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}