{"extracted_information": "Полная информация о системе инвентаря в Minecraft, включая структуру слотов, типы слотов, горячую панель, слоты брони, механику стэкинга предметов и управление инвентарем.", "specifications": {"slot_structure": {"armor_slots": 4, "storage_slots": 27, "hotbar_slots": 9, "off_hand_slot": 1}, "stacking_mechanics": {"max_stack_64": "Большинство предметов (все блоки, большинство предметов)", "max_stack_16": "Некоторые предметы (снежки, пустые ведра, яйца, таблички, висячие таблички, эндер-жемчуг)", "non_stackable": "Предметы с прочностью (оружие, броня, инструменты), заполненные ведра, зелья", "technical_stack_99": "Все предметы могут технически стакаться до 99 с использованием компонентов, но это не используется в игре."}, "crafting_grid": {"type": "2x2", "mode": "Survival/Adventure", "functionality": "Позволяет создавать рецепты, которые подходят, не предоставляет хранение предметов."}}, "pricing": {}, "features": [{"name": "Открытие и закрытие инвентаря", "description": "Открывается нажатием 'E' (различные кнопки на консолях и мобильных устройствах). Закрывается 'Esc' (различные кнопки на консолях и мобильных устройствах). Клавиши можно изменить в настройках. Инвентарь сохраняется при выходе из мира или сервера."}, {"name": "Горячая панель (Hotbar)", "description": "9 слотов, доступ к предметам через клавиши 1-9 или колесо мыши. Клавиша 'F' перемещает выбранный предмет между горячей панелью и слотом для второй руки."}, {"name": "Слоты брони", "description": "4 слота. Броня считается надетой только при размещении в этих слотах. Надевается использованием, обмениваясь с уже надетым предметом."}, {"name": "Всплывающие подсказки (Tooltips)", "description": "При наведении курсора на предмет отображаются название, зачарования, лор и специфическая информация (например, версия написанной книги). В Java Edition, нажатие F3+H показывает дополнительную информацию: ID, значения данных."}, {"name": "Взаимодействие с внешними инвентарями", "description": "Использование блока с инвентарем (сундук, верстак, печь) открывает его GUI, позволяя переносить предметы между 27 основными слотами, 9 слотами горячей панели и GUI блока. Единственные доступные слоты для установки атрибутов: 'mainhand', 'offhand', 'head', 'chest', 'legs', 'feet'."}, {"name": "Книга рецептов", "description": "Каталог всех рецептов, служит руководством по крафту. Показывает все рецепты, для которых у игрока были материалы. Категории в Java Edition: Все, Инструменты/Оружие/Броня, Строительные материалы, Еда/Разное, Редстоун. В Bedrock Edition: Все, Строительство, Оборудование, Предметы, Природа."}, {"name": "Управление инвентарем", "sub_features": [{"name": "Захват и разделение стаков", "description": "Левый клик: захватывает весь стак. Правый клик: разделяет стак пополам (нечетные стаки оставляют меньшую половину). Левый клик с предметом в курсоре: помещает полный стак в слот. Правый клик с предметом в курсоре: помещает по одному предмету за раз."}, {"name": "Двойной клик", "description": "Двойной клик по предмету: захватывает до полного стака всех предметов этого типа в инвентаре."}, {"name": "Перемещение Shift+Click", "description": "Shift+Click по предмету: перемещает предмет с горячей панели в 27 основных слотов инвентаря или наоборот. При открытом инвентаре блока (сундук, раздатчик и т.д.): перемещает стак между инвентарем игрока и инвентарем блока. Shift+Двойной клик: перемещает все предметы этого типа между инвентарем игрока и блоком, или между инвентарем и горячей панелью (требуется предмет в курсоре)."}, {"name": "Перемещение по слотам (клавиши 1-9)", "description": "Наведение курсора на слот инвентаря и нажатие 1-9: меняет местами предмет в этом слоте с предметом в соответствующем слоте горячей панели, или перемещает предмет, если один из слотов пуст. В Java Edition, 'F' действует аналогично для слота второй руки."}, {"name": "Перетаскивание стаков", "description": "Перетаскивание левой кнопкой мыши: равномерно распределяет стак по перетаскиваемым слотам. Перетаскивание правой кнопкой мыши: помещает по одному предмету в каждый перетаскиваемый слот. Работает только если слот пуст или содержит тот же предмет."}, {"name": "Режим Creative (средний клик)", "description": "В режиме Creative: средний клик по слоту в инвентаре захватывает полный стак предмета, оставляя оригинал в слоте. Перетаскивание средней кнопкой мыши: помещает полный стак предмета в каждый перетаскиваемый слот (только Java Edition)."}, {"name": "Сохранение горячих панелей (Creative)", "description": "Нажатие C+1-9 в режиме Creative: сохраняет текущую панель инструментов. Загружается X+1-9."}, {"name": "Выбрасывание предметов", "description": "Нажатие клавиши выброса при наведении курсора на слот: выбрасывает один предмет. Удержание Ctrl + клавиша выброса: выбрасывает весь стак. Выбрасывание вне окна инвентаря: выбрасывает предмет из курсора."}]}, {"name": "Креативный инвентарь", "description": "В режиме Creative инвентарь содержит меню выбора блоков со всеми блоками и предметами из выживания, а также некоторые дополнительные предметы. Организован по вкладкам."}, {"name": "Внешние инвентари", "description": "Многие блоки и некоторые сущности имеют собственные меню инвентаря для манипуляции предметами (например, сундуки, печи, раздатчики, столы зачарований, верстаки, торговые интерфейсы жителей, хопперы, инвентари животных)."}, {"name": "Инвентарь мобов", "description": "Некоторые мобы имеют слоты инвентаря: Villagers (8 слотов, недоступны игроку, для сбора семян/еды), Piglins (8 слотов, недоступны игроку, для сбора предметов), Pillagers (5 слотов, недоступны игроку, не используются), Agents (27 слотов, доступны игроку через GUI, только Minecraft Education), Donkeys/Mules с сундуком (15 слотов, доступны игроку), Llamas с сундуком (3, 6, 9, 12 или 15 слотов в зависимости от силы), Allays (1 слот, недоступен игроку, для сбора предметов, соответствующих предмету в руке игрока)."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}