{"extracted_information": "Наковальня Minecraft — это универсальный блок, позволяющий игрокам ремонтировать инструменты, оружие и броню, объединять зачарования и переименовывать предметы. Каждое использование наковальни расходует очки опыта. Наковальня обладает ограниченной прочностью и имеет несколько стадий износа.", "specifications": {"изготовление": "4 железных слитка + 3 железных блока = 1 наковальня (всего 31 железный слиток)", "прочность": "В среднем 25 использований", "стадии_износа": ["нормальная", "отколотая", "поврежденная"], "механика_износа": "Каждое использование имеет 12% шанс изменить стадию износа", "особые_свойства": "Реагирует на гравитацию (падает), может наносить урон при падении, не может быть перемещена поршнями."}, "pricing": {"стоимость_опыта": {"ремонт_материалом": "1 очко опыта за единицу материала (восстанавливает 25% прочности); стоимость возрастает при многократном ремонте или других действиях наковальней.", "переименование": "1 очко опыта дополнительно к стоимости предыдущих ремонтов и переименований."}}, "features": [{"название": "Ремонт инструментов, оружия и брони", "описание": "Восстановление прочности предметов. Есть два способа: использование производственного материала (например, железный слиток для железного меча) или объединение двух одинаковых предметов. При объединении прочность суммируется и добавляется еще 12% (но не более максимальной прочности). Совместимые зачарования также объединяются."}, {"название": "Переименование предметов", "описание": "Игроки могут переименовывать почти любой предмет, включая инструменты, бирки, стопки блоков, оружие, броню, ведра с рыбой. Переименованные блоки можно складывать только с предметами того же имени. Выпущенная рыба будет названа по имени ведра."}, {"название": "Объединение зачарований", "описание": "Зачаровывание предметов путем помещения их вместе с зачарованной книгой. Правила объединения: если оба предмета имеют зачарование одного уровня, уровень увеличивается на 1; если зачарование на среднем предмете ниже, ничего не меняется; если зачарование выше, оно передается; новые зачарования передаются с их уровнями, если у левого предмета их еще нет. Не все зачарования совместимы. Можно объединять две зачарованные книги с одинаковым заклинанием для его улучшения."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}