{"extracted_information": "Крафт (создание) в Minecraft — это основной способ получения большинства блоков и предметов. Для создания предметов игрок должен определённым образом разместить ресурсы в сетке крафта.", "specifications": {"сетка крафта": {"инвентарь": "2x2", "верстак": "3x3"}}, "features": [{"название": "Сетка крафта 2x2", "описание": "Доступна непосредственно в инвентаре игрока. Позволяет создавать простые предметы, требующие до 4 ингредиентов. Может использоваться для рецептов, не требующих строгого расположения ингредиентов, если все ингредиенты помещаются."}, {"название": "Сетка крафта 3x3 (Верстак)", "описание": "Требует создания и установки верстака. Предназначена для крафта более сложных предметов, требующих до 9 ингредиентов."}, {"название": "Правила крафта", "пункты": ["Требуется наличие определённых ингредиентов.", "Ингредиенты, такие как доски, каменный кирпич, песчаник, шерсть, могут быть любого вида для большинства рецептов (за исключением покраски шерсти в Bedrock/Java 1.20+).", "Ингредиенты должны быть расположены определённым образом друг относительно друга (за исключением некоторых рецептов, где порядок не важен, например, красители, цветная шерсть, тушёные грибы, приготовленный паучий глаз, огненный шар).", "Расположение ингредиентов в сетке крафта не всегда имеет значение в пределах возможных вариантов. Например, факел можно скрафтить, поместив уголь над палкой 2 способами в сетке 2x2 или 6 способами в 3x3. Рецепты могут быть несимметричны относительно вертикальной оси и могут быть созданы зеркально (например, топор, мотыга, огниво, ножницы, ступени, удочка, лук).", "За один щелчок по значку результата используется один ингредиент из каждой ячейки. При зажатии клавиши Shift создается максимально возможное количество предметов."]}, {"название": "MATTIS (Minecraft Advanced Touch Technology Interface System)", "описание": "Система крафта, использовавшаяся в карманном издании Minecraft (Pocket Edition) для сенсорных экранов. В отличие от ПК-версии, не требовала ручной расстановки ингредиентов; они автоматически располагались при выборе предмета из списка рецептов. Была заменена классической системой крафта в Bedrock Edition.", "подробности": {"интерфейс": "Справа расположена сетка крафта, ниже — кнопка создания предмета. Слева — список доступных блоков и предметов.", "особенность": "Ингредиенты располагаются автоматически при выборе рецепта из списка."}}, {"название": "Упрощённая система крафта (Консоли)", "описание": "Изначально добавлена для консольных изданий. Позже в качестве альтернативы была добавлена классическая система крафта."}, {"название": "Книга рецептов", "описание": "Интерфейс, позволяющий просматривать доступные рецепты и автоматически размещать ингредиенты в сетке крафта, если они есть в инвентаре. Добавлена в Java Edition 1.12 и Bedrock Edition 1.2."}], "statistics": {}, "temporal_info": {"история добавления/изменения крафта": [{"версия": "Indev 0.31 20100129", "событие": "Крафт добавлен в игру, ранние рецепты (палки, кирки, факелы, мечи, топоры, золотые/железные блоки). Добавлен управляемый инвентарь."}, {"версия": "Indev 0.31 20100130", "событие": "Добавлено множество новых рецептов."}, {"версия": "Beta 1.2 (Java Edition)", "событие": "Добавлены бесформенные рецепты."}, {"версия": "Beta 1.8 (Java Edition)", "событие": "Добавлена возможность создания максимального количества предметов по Shift-клику."}, {"версия": "Java Edition 1.8 (14w30a)", "событие": "Добавлены фиксированные рецепты."}, {"версия": "Java Edition 1.12 (17w13a)", "событие": "Добавлена книга рецептов."}, {"версия": "Pocket Edition (17 апреля 2012)", "событие": "Представлена система MATTIS (Minecraft Advanced Touch Technology Interface System)."}, {"версия": "Pocket Edition 0.3.0", "событие": "Система крафта MATTIS добавлена в игру."}, {"версия": "Pocket Edition 0.9.0 build 1", "событие": "Распределение блоков и предметов в окне крафта по категориям. Окно крафта показывает только доступные рецепты."}, {"версия": "Pocket Edition 0.12.0", "событие": "Добавлена классическая система крафта для Windows 10 издания."}, {"версия": "Pocket Edition 0.13.0", "событие": "Удалён функционал камнереза, его рецепты перенесены в стандартный крафт."}, {"версия": "Pocket Edition 0.14.0 build 1", "событие": "Добавлена возможность доступа к системе крафта в творческом режиме."}, {"версия": "Pocket Edition 1.0 build 1", "событие": "Добавлена возможность доступа к классической системе крафта для мобильных устройств."}, {"версия": "Bedrock Edition 1.2 (beta 1.2.0.2)", "событие": "Система крафта MATTIS заменена классической системой крафта. Добавлена книга рецептов для классической системы крафта."}, {"версия": "Legacy Console Edition (TU1/CU1/1.00/Patch 1/1.0.1)", "событие": "Добавлена упрощённая система крафта."}, {"версия": "Legacy Console Edition (TU25/CU14/1.17)", "событие": "Добавлена классическая система крафта как альтернатива упрощённой."}]}, "geographical_data": {}, "references": []}