{"extracted_information": "Minecraft представляет собой игру с открытым миром, основная механика которой заключается в размещении и разрушении блоков для взаимодействия с миром и создания структур. Игровой процесс не имеет конечной цели, позволяя игрокам ставить собственные задачи. В игре реализованы различные типы движения персонажа и базовая физика, такая как гравитация для некоторых блоков. Различные игровые режимы существенно влияют на доступные механики, включая взаимодействие с блоками, бессмертие и способности к передвижению.", "specifications": {"игровой_процесс_основы": {"основная_деятельность": "Размещение и разрушение блоков в случайно созданном мире.", "цель_игры": "Открытый игровой процесс без конечной цели; игроки устанавливают свои собственные задачи.", "влияние_на_мир": "Игроки могут влиять на мир, строить и уничтожать структуры с помощью блоков.", "историческое_развитие": "В ранних версиях (Indev, Infdev, Alpha, Beta) были добавлены крафт, предметы, мобы, динамическое освещение, фермерство, новые блоки, улучшенный генератор карт и другие элементы."}, "система_блоков": {"функциональность": "Базовый элемент взаимодействия, включающий размещение и разрушение.", "разнообразие": "Различные виды блоков с уникальными функциями и свойствами.", "пример_свойств": "Песок падает под действием силы тяжести, если под ним нет блока.", "применение": "Строительство замков, дорог, зданий, мостов, пиксель-арта, стадионов для сплифа и мини-игр.", "доступность_блоков_по_режимам": {"творчество": "Бесконечное количество блоков, мгновенное уничтожение.", "приключение": "Невозможно устанавливать или уничтожать блоки без правильных инструментов (с 14w02a вообще невозможно).", "наблюдение": "Невозможно устанавливать или уничтожать блоки.", "выживание_хардкор": "Возможно получение неограниченного количества возобновляемых ресурсов (дерево, булыжник, вода)."}}, "физика": {"гравитация": "Присутствует, проявляется, например, в падении песка при отсутствии поддержки.", "пустота": "Падение в пустоту приводит к смерти персонажа даже в режимах Творчество и Наблюдение."}, "движение_персонажа": {"типы_движения": ["Ползание", "Полёт", "Парение (с элитрами)", "Прыгание", "Приседание", "Бег", "Плавание", "Ходьба"], "специфика_движения_по_режимам": {"творчество": "Возможность летать.", "наблюдение": "Возможность летать сквозь блоки, режим полёта неотключаем, при полёте сквозь твёрдые блоки видны ближайшие полости."}}, "коллизии": {"поведение": "Игроки обычно не могут проходить сквозь блоки, что подразумевает наличие коллизий.", "исключение": "В режиме Наблюдения игроки могут летать сквозь блоки, отключая коллизии с ними.", "взаимодействие": "В режиме Приключения возможно взаимодействие с переключателями, механизмами и мобами."}}, "features": [{"режим": "Выживание", "описание": "Игроки должны добывать материалы для строительства и крафта, получать опыт. Присутствуют шкалы здоровья, голода, брони, воздуха (под водой). Есть инвентарь.", "механики": ["Добывание ресурсов", "Крафт", "Получение опыта", "Управление здоровьем и голодом", "Броня", "Дыхание под водой"]}, {"режим": "Творчество", "описание": "Игроки могут летать, имеют доступ к бесконечному количеству предметов и блоков, которые мгновенно уничтожаются. Игроки неуязвимы и почти бессмертны. Отсутствуют шкалы здоровья, голода, воздуха, брони. Доступны яйца призывания мобов.", "механики": ["Полёт", "Бесконечные ресурсы", "Мгновенное уничтожение блоков", "Неуязвимость (смерть только от Пустоты или команды /kill)", "Отсутствие шкал выживания"]}, {"режим": "Приключение", "описание": "Игроки могут взаимодействовать с переключателями, механизмами и мобами, но не могут устанавливать и уничтожать блоки без правильных инструментов (или вообще). Недоступен при создании мира, активируется командой /gamemode 2.", "механики": ["Взаимодействие с объектами и мобами", "Ограниченное или отсутствующее разрушение/установка блоков", "Отсутствие полёта"]}, {"режим": "Хардкор", "описание": "Аналогичен Выживанию, но сложность всегда 'Сложно'. После смерти мир либо удаляется, либо доступен для просмотра в режиме Наблюдения. Технически является опцией, а не отдельным режимом. При многопользовательской игре после смерти игрок блокируется, а после блокировки всех игроков мир удаляется.", "механики": ["Постоянная высокая сложность", "Перманентная смерть (удаление мира или переход в режим наблюдения)", "Блокировка умерших игроков на сервере"]}, {"режим": "Наблюдение", "описание": "Игроки могут летать сквозь блоки и наблюдать от лица любой сущности (кроме Дракона Края). Не могут устанавливать или уничтожать блоки. Активируется командой /gamemode 3 или после смерти в Хардкорном режиме. Возможно умереть, залетев под коренную породу. Режим полёта неотключаем, видны полости в слое блоков.", "механики": ["Полёт сквозь блоки", "Наблюдение от лица сущностей", "Невозможность взаимодействия с миром (разрушение/установка блоков)", "Постоянный полёт", "Просмотр скрытых полостей"]}, {"режим": "Демонстрационный режим", "описание": "Доступен в любой версии игры. Игрок может играть 5 игровых дней (около 1 часа 40 минут). Спаун в одном месте на определённом зерне в режиме выживания с бонусным сундуком. Режим выживания всегда включён по умолчанию, но может быть изменён через чит-коды.", "механики": ["Ограниченное время игры", "Фиксированный спаун и бонусный сундук", "Принудительный режим выживания (по умолчанию)", "Возможность включения чит-кодов для смены режима"]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}