{"extracted_information": "Системы Jigsaw структур в Minecraft используются для процедурной генерации сложных структур, таких как аванпосты разбойников, деревни, бастионы и древние города. Генерация происходит пошагово, начиная с начального элемента и последовательно подключая другие части с использованием блоков-головоломок (jigsaw blocks) и пулов шаблонов. Процесс учитывает такие параметры, как глубина генерации, максимальное расстояние от центра, адаптация к ландшафту и ограничения на высоту, а также может быть настроен через пакеты данных или дополнения.", "specifications": {"java_edition_config": {"type": "jigsaw", "start_pool": "ID пула шаблонов или его определение; начальный пул шаблонов.", "size": "Глубина генерации Jigsaw структур; значение от 0 до 20 (включительно).", "start_height": "Начальная высота структуры; если project_start_to_heightmap установлен, то смещение от карты высот.", "project_start_to_heightmap": "Опционально; тип карты высот для проецирования начальной высоты (WORLD_SURFACE_WG, WORLD_SURFACE, OCEAN_FLOOR_WG, OCEAN_FLOOR, MOTION_BLOCKING, MOTION_BLOCKING_NO_LEAVES).", "start_jigsaw_name": "Опционально; имя блока-головоломки, к которому присоединяется начало структуры.", "max_distance_from_center": "Определяет максимальное расстояние любой части от начала структуры.", "max_distance_from_center_horizontal": "Максимальное горизонтальное расстояние Чебышева от начала структуры; значение от 1 до 128 (до 116 при terrain_adaptation != none); с JE 1.21.9.", "max_distance_from_center_vertical": "Максимальное вертикальное расстояние любой части от начала структуры; опционально, значение от 1 до 4096 (по умолчанию 4096); с JE 1.21.9.", "use_expansion_hack": "Логическое; позволяет вертикально расширять границы структуры при необходимости.", "pool_aliases": "Опционально; список определений псевдонимов пулов для перенаправления ссылок на пулы.", "dimension_padding": "Опционально, по умолчанию 0; отступы от верхнего и нижнего пределов мира.", "dimension_padding_bottom": "Неотрицательное, по умолчанию 0; количество блоков, исключенных из нижней границы внешнего ограничивающего блока структуры.", "dimension_padding_top": "Неотрицательное, по умолчанию 0; количество блоков, исключенных из верхней границы внешнего ограничивающего блока структуры.", "liquid_settings": "Опционально, по умолчанию 'apply_waterlogging'; как генерируются блоки с состоянием 'waterlogged' при наложении на воду ('apply_waterlogging' или 'ignore_waterlogging')."}, "bedrock_edition_config": {"format_version": "Версия формата.", "identifier": "Идентификатор для команд /locate и /place.", "biome_filter": "Биомы, в которых разрешена генерация структуры.", "step": "Шаг генерации структуры.", "terrain_adaptation": "Тип адаптации к ландшафту ('none', 'beard_thin', 'beard_box', 'bury', 'encapsulate').", "start_pool": "ID пула шаблонов; начальный пул шаблонов.", "max_depth": "Глубина генерации Jigsaw структур; значение от 0 до 20 (включительно).", "start_height": "Начальная высота структуры; если heightmap_projection установлен, то смещение от карты высот.", "heightmap_projection": "Опционально; тип карты высот для проецирования начальной высоты ('world_surface' или 'sea_floor').", "start_jigsaw_name": "Опционально; имя блока-головоломки, к которому присоединяется начало структуры.", "max_distance_from_center": "Максимальное 3D расстояние Чебышева от блоков-головоломок до начала структуры; значение от 1 до 128 (включительно).", "pool_aliases": "Опционально; используются для перенаправления ссылок на пулы."}}, "features": ["Используются для генерации следующих структур: аванпосты разбойников (pillager outposts), деревни (villages), бастионы (bastion remnants), древние города (ancient cities), разрушенные тропы (trail ruins) и пробные камеры (trial chambers).", "Генерацию можно настроить с помощью пакетов данных (Java Edition) или дополнений (Bedrock Edition)."], "algorithms": {"components": {"piece": "Базовая часть структуры, может быть шаблоном структуры или размещенным элементом (placed feature).", "template_pool": "Набор элементов (pieces), из которого случайно выбираются части структуры."}, "generation_process": {"step_1_starting_piece": {"description": "Определение и размещение начального элемента структуры.", "details": ["Структура определяет начальный пул (start_pool).", "Из start_pool выбирается элемент и помещается в начальную позицию (0,0 координаты начального чанка).", "Поворот и начальный шаблон выбираются случайным образом на основе координат чанка и сида мира.", "Если выбран 'minecraft:empty_pool_element', генерация не происходит (только Java Edition).", "Начальная высота определяется параметром start_height или проецируется на карту высот (project_start_to_heightmap / heightmap_projection).", "Если указан start_jigsaw_name, выбирается случайный блок-головоломка с этим именем; в противном случае размещается северо-западный угол элемента (без поворота).", "Генерация прерывается, если конечная позиция начального элемента слишком близка к пределам сборки (из-за dimension_padding).", "Начальный элемент помещается в очередь генерации."]}, "step_2_connecting_pieces": {"description": "Последовательная обработка очереди генерации и соединение элементов.", "details": ["Элементы из очереди генерации обрабатываются последовательно (родительские элементы).", "Блоки-головоломки родительского элемента используются для генерации соединяющихся элементов, обрабатываясь по приоритету выбора (от высокого к низкому) и затем в случайном порядке.", "Выбор соединяющегося элемента:", "  - Блок-головоломка ссылается на 'target pool'.", "  - Псевдонимы пулов (pool_aliases) определяют фактический пул шаблонов для использования.", "  - Элементы выбираются из пула шаблонов (случайно, с учетом веса).", "  - Если достигнута максимальная глубина (size / max_depth), выбор из основного пула пропускается, используется только запасной пул (fallback pool).", "Попытка размещения соединяющегося элемента:", "  - Из выбранного элемента выбирается случайный блок-головоломка, который: смотрит за границы элемента, имеет 'name', совпадающее с 'target name' родительского блока, и совместимую ориентацию (только горизонтальное вращение).", "  - Элемент размещается таким образом, чтобы блоки-головоломки соединялись друг с другом.", "  - Если элемент или новый выбранный элемент имеют 'terrain matching', он перемещается по вертикали для выравнивания с ландшафтом.", "Условие размещения элемента:", "  - Элемент не должен превышать внешний ограничивающий блок, определяемый 'max_distance_from_center' и 'dimension_padding'.", "  - Элемент не должен пересекаться с другими уже размещенными элементами (за исключением тех, внутри которых он размещен).", "  - В случае неудачи размещения, попытка повторяется со следующим элементом; если все попытки неудачны, блок-головоломка не размещает элемент.", "  - При успешном размещении, новый элемент добавляется в очередь генерации согласно его приоритету размещения."]}, "step_3_processing": {"description": "Финальная обработка каждого элемента после его размещения.", "details": ["Каждый размещенный элемент обрабатывается, при этом блоки изменяются или удаляются из шаблона.", "Обработка осуществляется с использованием 'processor_list', указанного для каждого элемента в пуле шаблонов.", "Блоки-головоломки заменяются на их конечное состояние 'Turns into' (используя процессор 'minecraft:jigsaw_replacement' в Java Edition).", "Для элементов с адаптацией к ландшафту (terrain matching) каждый столбец блоков регулируется по высоте для соответствия ландшафту (используя процессор 'minecraft:gravity' в Java Edition)."]}}, "pool_aliases_mechanism": {"description": "Механизм для перенаправления ссылок на пулы шаблонов перед началом генерации, обеспечивающий гибкость в выборе элементов.", "types": [{"type": "direct", "parameters": "alias (ID), target (ID пула шаблонов); перенаправляет alias на конкретный target."}, {"type": "random", "parameters": "alias (ID), targets (список возможных целей с весами); выбирает одну цель случайным образом для перенаправления alias на структуру."}, {"type": "random_group", "parameters": "groups (список групп с весами, каждая группа содержит список псевдонимов пулов); выбирает группу случайным образом и применяет все псевдонимы, содержащиеся в этой группе."}]}}, "temporal_info": {"history_java_edition": [{"version": "1.14 (18w46a)", "event": "Добавлены блоки-головоломки (jigsaw blocks)."}, {"version": "18w47a", "event": "Добавлены Jigsaw структуры (в форме аванпостов разбойников)."}, {"version": "1.16.2 (20w28a)", "event": "Jigsaw структуры стали настраиваемыми через пакеты данных, с максимальным радиусом 80 блоков."}, {"version": "1.19 (Deep Dark Experimental Snapshot 1)", "event": "Включена генерация древних городов с радиусом 128."}, {"version": "22w11a", "event": "Типы структур ('village', 'pillager_outpost', 'bastion_remnant') объединены в единый тип 'jigsaw'. Добавлены поля start_height, project_start_to_heightmap и use_expansion_hack."}, {"version": "22w12a", "event": "Добавлено поле max_distance_from_center."}, {"version": "22w13a", "event": "Поле adapt_noise заменено на terrain_adaptation."}, {"version": "22w17a", "event": "Добавлено поле start_jigsaw_name."}, {"version": "1.20.3 (23w42a)", "event": "Добавлено поле pool_aliases."}, {"version": "1.21 (24w19a)", "event": "Добавлено поле dimension_padding."}, {"version": "24w20a", "event": "dimension_padding теперь может быть задан отдельно для верхней и нижней частей."}, {"version": "1.21-pre1", "event": "Добавлено поле liquid_settings."}, {"version": "1.21.9 (предстоящая 25w31a)", "event": "Поле max_distance_from_center теперь может задавать разные ограничения для вертикальной и горизонтальной осей."}], "history_bedrock_edition": [{"version": "1.10.0 (beta 1.10.0.3)", "event": "Добавлены блоки-головоломки (jigsaw blocks)."}, {"version": "1.21.50 (Preview 1.21.50.26) Experiment Data-Driven Jigsaw Structures", "event": "Jigsaw структуры стали настраиваемыми через дополнения с использованием JSON-файлов."}]}}