{"extracted_information": "Крафтинг — это процесс создания инструментов, предметов и блоков в Minecraft, который может быть выполнен через инвентарь, верстак или автоматически с использованием крафтера. В отличие от других игровых действий (плавка, варка зелий, зачарование), крафтинг происходит абсолютно бесшумно.", "specifications": {"crafting_grids": {"2x2_grid": "Доступна в инвентаре игрока. Используется для создания небольших рецептов, таких как деревянные доски, палки, верстаки и факелы.", "3x3_grid": "Доступна через верстак. Позволяет создавать любые рецепты в игре, включая те, что подходят для сетки 2х2."}}, "features": {"manual_crafting": "Игроки размещают предметы в сетке крафтинга вручную, чтобы соответствовать рецепту.", "automated_crafting": "Осуществляется с помощью крафтера. Крафтер может автоматизировать процесс создания предметов, используя воронки для ввода ингредиентов. Он может создавать все, что может обычный верстак, и требует редстоун-сигнала для активации. Полезен для автоматических ферм и систем хранения.", "recipe_book": "Механика, служащая каталогом рецептов и руководством по крафтингу, показывающая все разблокированные рецепты и позволяющая автоматически размещать ингредиенты. Организован по категориям, которые различаются между Java и Bedrock Edition."}, "types_of_recipes": {"shaped_recipes": "Требуют, чтобы ингредиенты были расположены в определенном порядке и форме на сетке крафтинга. Могут быть перемещены вверх, вниз, влево, вправо или отзеркалены (например, хлеб, лук).", "shapeless_recipes": "Не требуют специфического расположения ингредиентов на сетке крафтинга; ингредиенты можно размещать в любом месте (например, сброженное паучье око).", "fixed_recipes": "Не могут быть перемещены или отзеркалены. Примеры включают красители в рецептах знамен в Bedrock Edition. В Java Edition фиксированных рецептов нет, но их можно добавить с помощью датапаков или модов."}, "crafting_stations": [{"name": "Инвентарь", "grid_size": "2x2", "description": "Базовая сетка крафтинга, доступная игроку в любое время."}, {"name": "Верстак", "grid_size": "3x3", "description": "Позволяет создавать более сложные предметы, предоставляя большую сетку крафтинга."}, {"name": "Крафтер", "grid_size": "3x3", "description": "Продвинутая крафт-станция, позволяющая автоматизировать процесс крафтинга. Может использовать воронки для автоматической подачи предметов и требует редстоун-сигнала для активации. Способен создавать все те же предметы, что и верстак."}]}