{"extracted_information": "Руководство по редстоуну в Minecraft, описывающее основные принципы работы, компоненты, сигналы, проводку и логические схемы. Редстоуновые схемы аналогичны электрическим цепям и позволяют управлять механизмами, реагировать на переключатели и выполнять логические преобразования.", "specifications": {"редстоун": {"источник": "редстоуновая руда (добывается железной, алмазной или незеритовой киркой)", "количество_с_блока": "4-5 единиц (без зачарования на Удачу)", "размещение": "на верх других полных непрозрачных блоков", "разрушение": "от одного удара или попадания жидкости"}, "сигнал_редстоуна": {"уровни_активации": "0 (выключен) - 15 (включен)", "логическое_0": "выключен", "логическая_1": "включен (для большинства механизмов)", "затухание": {"редстоуновая_пыль": "уровень сигнала уменьшается на 1 с каждым новым подключенным проводом (макс. 15 блоков)", "электрические_рельсы": "дальность 10 блоков", "листва": "дальность 6 блоков", "каменные_ограды": "нет затухания вертикально вниз"}, "визуализация_сигнала": "чем меньше уровень сигнала, тем тусклее цвет провода; над включенным проводом идет дымок (при высоких настройках частиц)"}, "редстоуновый_факел": {"задержка": "1 редстоуновый такт (0.1 секунды)", "яркость_света": "7"}, "редстоуновый_повторитель": {"задержка": "от 0.1 до 0.4 секунды (настраивается ПКМ: 0.1 → 0.2 → 0.3 → 0.4 → 0.1)", "свойства": "рестранслятор, диод, элемент задержки, твердый блок", "блокировка": "возможна с версии 1.4; требует включенного повторителя/компаратора (>0) сбоку; удерживает состояние до снятия блокировки"}, "редстоуновый_компаратор": {"режимы_работы": "сравнение (A >= B -> A, A < B -> 0), вычитание (A > B -> A-B, A <= B -> 0)", "задержка": "1 редстоуновый такт"}, "таймеры": {"игровой_такт": "1/20 секунды", "редстоуновый_такт": "0.1 секунды"}, "кнопка": {"каменная": "1 секунда активации", "деревянная": "1.6 секунды активации (активируется стрелой)"}, "предметный_таймер": {"время_исчезновения_предмета": "5 минут", "задержка_импульса": "четверть игровых суток"}, "быстрый_таймер_на_воронках": {"задержка": "0.4 секунды (8 тактов)"}, "долгий_таймер_на_воронках": {"максимальная_задержка_на_одну_воронку": "около 128 секунд (при 5 стаках по 64 единицы)"}, "генераторы_нулевого_такта": {"частота_полноценных_генераторов": "20 раздельных сигналов в секунду"}}, "features": [{"название": "Сигналы и проводка", "описание": "Редстоуновая пыль укладывается в виде провода, соединяя соседние участки. Может быть активирована различными источниками сигнала. Поддерживает 16 уровней сигнала (0-15), где 0 - выключен, 1-15 - включен. Провода не излучают свет, только меняют текстуру. Сигнал затухает с расстоянием: каждый блок уменьшает уровень на 1. Возможно объединение проводов, расположенных на разных высотах (разница не более 1 блока), если нет полных блоков между ними. Прозрачные блоки (стекло, светящийся камень, плиты, поршень, воронка, наблюдатель, медная лампа) могут передавать сигнал редстоуна вверх, но не вниз."}, {"название": "Источники сигнала (переключатели)", "список": ["Рычаг: имеет два состояния (вкл/выкл), переключается щелчком. Можно установить сверху, сбоку или снизу блока.", "Кнопка: временный сигнал (каменная - 1с, деревянная - 1.6с). Каменная активируется щелчком, деревянная - щелчком или стрелой. Устанавливается сбоку, сверху, снизу блока.", "Нажимная пластина: напольная, активируется при нажатии. Деревянная реагирует на игрока/предмет/стрелу, каменная - только на игрока.", "Утяжелённая нажимная пластина (железная/золотая): реагирует только на предметы, сила сигнала зависит от количества предметов.", "Нажимные рельсы: реагируют на проезжающие вагонетки.", "Натяжной датчик: активируется при касании нити игроком, мобом, предметом, сферой опыта, стрелой или падающими блоками.", "Датчик дневного света: регистрирует силу света от солнца (пропорциональный сигнал) или темноту (в 'ночном' режиме).", "Сундук-ловушка: подаёт сигнал при открытии, сила сигнала зависит от количества игроков.", "Мишень: временный сигнал при попадании снаряда, сила сигнала зависит от близости к центру."]}, {"название": "Источники сигнала (без переключений)", "список": ["Редстоуновый блок: слабо активирует прилегающие блоки.", "Редстоуновый факел: способы работы описаны отдельно."]}, {"название": "Устройства вывода (механизмы)", "описание": "Различные блоки, управляемые редстоуном.", "список": ["Постоянного действия (меняют состояние и сохраняют его): Двери, люки, ворота, поршни, электрические/активирующие рельсы, лампы, загрузочные воронки.", "Однократного действия (активируются один раз при подаче сигнала): Раздатчики, выбрасыватели, музыкальные блоки, ТНТ, командные блоки (требуют повторной подачи сигнала для активации)."]}, {"название": "Активация блоков", "описание": "Полные непрозрачные блоки могут быть 'заряжены' и включать соседние механизмы. Различают 'сильную' и 'слабую' зарядку.", "сильно_заряженные_источники": "редстоуновый факел (снизу), повторитель, компаратор, переключатель.", "слабо_заряженные_источники": "редстоуновый провод.", "различия_зарядки": "сильно заряженный блок активирует редстоуновый провод со всех сторон, слабо заряженный - нет."}, {"название": "Вертикальная передача сигнала", "описание": "Возможна с помощью 'винтовой лестницы' из проводов, или цепей инверторов (факелов). Прозрачные блоки могут передавать сигнал вверх, но не вниз. Есть компактные вертикальные схемы."}, {"название": "Логические элементы (гейты)", "описание": "Конструкции, выполняющие логические операции над сигналами.", "список": [{"название": "НЕ (NOT/Инвертор)", "описание": "Возвращает противоположный сигнал. Реализуется с помощью редстоунового факела (гаснет при активации блока, на котором стоит), компаратора (вычитание из 15), поршня (передвигает редстоуновый блок), воронки и выбрасывателя (по заполнению контейнеров)."}, {"название": "ИЛИ (OR/Дизъюнкция)", "описание": "Возвращает 1, если хотя бы на одном входе есть 1. Реализуется объединением проводов (монтажная логика), с помощью прозрачных блоков (нулевая задержка), двойного отрицания или повторителей/компараторов."}, {"название": "ИЛИ-НЕ (NOR/Стрелка Пирса)", "описание": "Возвращает 1, если на всех входах 0. Реализуется из вентиля ИЛИ с инвертором на выходе, или компактно с одним редстоуновым факелом."}, {"название": "И (AND/Конъюнкция)", "описание": "Возвращает 1, если на всех входах 1. Реализуется по формуле де Моргана (через НЕ и ИЛИ) или с использованием компараторов/листвы/поршней/наблюдателей."}, {"название": "И-НЕ (NAND/Штрих Шеффера)", "описание": "Возвращает 1, если хотя бы на одном входе 0. Получается из вентиля И без инвертора на выходе."}, {"название": "Исключающее ИЛИ (XOR/Строгая дизъюнкция)", "описание": "Возвращает 1, если только на одном из входов 1 (разные входные значения). Применяется для управления дверьми с обеих сторон. Реализуется различными способами, в т.ч. на компараторах или Т-триггере."}, {"название": "Исключающее ИЛИ-НЕ (XNOR)", "описание": "Возвращает 1, если на входах сигналы одинаковые. Получается из XOR добавлением инвертора на выходе."}, {"название": "Импликация (IMPLIES)", "описание": "Возвращает 1, если есть сигнал на B или нет сигнала на A. 0 только если A=1 и B=0."}]}, {"название": "Генераторы тактовых импульсов (Clock Generators)", "описание": "Схемы, циклично меняющие своё состояние.", "типы": ["На основе инверторов (факелов): кольцо из нечетного числа последовательных инверторов (мин. 3 факела, иначе перегорят). Есть компактные варианты с параллельными инверторами (быстрые, для ловушек).", "Таймер из повторителей: кольцо из повторителей. Стабильность зависит от количества повторителей. Можно строить сети таймеров.", "Железнодорожный таймер: использует вагонетку, движущуюся по кольцу с электрическими и нажимными рельсами. Период регулируется длиной кольца или скоростью вагонетки. Пример: автоферма тыкв/арбузов.", "Пульсар: на основе 4-х факелов, выдаёт нестабильную серию импульсов, может использоваться для генерации случайных последовательностей или очень быстрого сигнала.", "\"Предметный\" таймер: использует исчезновение выброшенных предметов через 5 минут для высокоточного таймера (четверть игровых суток).", "Таймеры на воронках: быстрые (0.4с) и долгие (до 128с на воронку, зависит от количества предметов).", "Таймеры на компараторах: основаны на задержке компаратора, могут быть без повторителя (высокая частота) или с повторителем (регулируемая частота).", "Таймер с высокой скважностью: использует естественное затухание сигнала и повторители для редких, коротких импульсов.", "Таймер на основе датчика дневного света: выдает короткий импульс раз в сутки (20 минут).", "Долгие таймеры (на основе T-триггеров): подключение T-триггеров к генератору удваивает период (2^n * t).", "Таймер на основе липкого поршня: простой, регулируемый повторителем, работает только при наличии сигнала.", "Таймеры на основе конъюнкции \"подтаймеров\": позволяют достигать очень больших периодов по мультипликативному закону. Требуют синхронного запуска подтаймеров.", "Таймеры на наблюдателях: 'таймер нулевого тика' (два наблюдателя друг на друга, постоянный сигнал), 'таймер на слизи' (с поршнем)."]}, {"название": "Запоминающие устройства (Триггеры/Flip-flops)", "описание": "Системы, хранящие состояние и меняющие его по внешним сигналам. Имеют прямой и обратный выходы. Бывают асинхронными и синхронными.", "встроенные_триггеры": "заблокированный повторитель, медная лампа, липкий поршень.", "список": [{"название": "RS-триггер (на NOR/NAND)", "описание": "Сохраняет состояние. На основе вентиля NOR (кольцо из двух инверторов) или NAND (с инверторами на входах/выходах). Неопределенное состояние при S=1, R=1 для NOR, и S=1, R=1 для NAND (не меняется)."}, {"название": "T-триггер", "описание": "При получении сигнала на входе меняет состояние выхода на противоположное (кнопка работает как рычаг). Используется в счетчиках. Различные реализации: на базе D-триггера (с заблокированными повторителями), на базе RS-NOR триггера (с вагонеткой, компараторами), на базе специфических механик (липкий поршень, выбрасыватели, медные лампы, воронки)."}, {"название": "Поршневые запоминающие устройства", "описание": "Хранят информацию в положении блока. 'Электрический' вариант (поршни двигают блок, перекрывающий/не перекрывающий сигнал), 'Механический' вариант (кнопки перемещают блок, без электрического выхода)."}]}, {"название": "Генераторы нулевого такта (Zero-Tick Generators)", "описание": "Схемы, генерирующие сигнал длиной менее 1 игрового такта. Используют последовательность обработки механизмов игрой.", "типы": ["Частичные: генерируют сигнал нулевого такта через определённый промежуток (напр., каждые 7 тактов на наблюдателе, поршне и слизи).", "Полноценные: генерируют сигнал нулевого такта каждый игровой такт (20 раздельных сигналов в секунду). Сложные схемы из нескольких частичных генераторов со сдвигом. Применимы для нотных блоков, колоколов, дверей, люков, медных ламп."]}, {"название": "Другие схемы", "список": ["Переключатель: меняет состояние нескольких проводов (по сути, инвертор).", "Мост: компактное пересечение перпендикулярных цепей с задержкой 0.1с.", "Детектор фронта сигнала: выдает короткий импульс при появлении ('восходящий') или исчезновении ('нисходящий') сигнала. Может быть на повторителях или компараторах.", "Инвертированный переключатель (ABBA Switch): сигнал подается A->B, затем B->A при включении, и наоборот при выключении. Используется для поршневых механизмов.", "Линии поддержки сигнала: увеличивают продолжительность сигнала. На повторителях (задержка 0.1с), воронках (долгие), компараторах (режим вычитания или затухание сигнала).", "Двусторонний повторитель: пропускает сигнал в обе стороны (в отличие от обычного повторителя).", "Тиристор: подает сигнал на выход при сигнале на обоих входах, сохраняет его при снятии сигнала с одного входа до полного отключения.", "Генератор короткого сигнала: из постоянного сигнала генерирует короткий. Полезен для схем, срабатывающих на выключение. Пример: экономичная срезалка урожая (9 поршней на большую площадь).", "Система подачи вагонеток: люк открывается на время падения одной вагонетки на рельсы (пример: 8 блоков высоты = 11 вагонеток)."]}], "statistics": {"количество_редстоуна_с_руды": "4-5 единиц", "максимальная_длина_сигнала_редстоун_пыли": "15 блоков", "максимальная_длина_сигнала_электрических_рельс": "10 блоков", "максимальная_длина_сигнала_листвы": "6 блоков", "задержка_редстоун_факела": "0.1 секунды (1 такт)", "задержка_редстоун_повторителя": "0.1 - 0.4 секунды", "задержка_редстоун_компаратора": "0.05 секунды (1 редстоуновый такт игрового цикла)", "длительность_сигнала_каменной_кнопки": "1 секунда", "длительность_сигнала_деревянной_кнопки": "1.6 секунды", "длительность_сигнала_предметного_таймера": "5 минут (четверть игровых суток)", "частота_быстрого_таймера_на_воронках": "0.4 секунды (8 тактов)", "период_долгого_таймера_на_воронках_с_максимальной_загрузкой": "около 128 секунд", "частота_генератора_нулевого_такта": "20 сигналов в секунду (для полноценных)"}, "temporal_info": {"игровые_версии_упоминаемые": {"12w24a": "рычаг может крепиться на нижнюю сторону блока", "1.3.1": "рычаг может крепиться на нижнюю сторону блока; деревянная нажимная пластина реагирует на стрелы", "14w04a": "кнопка может крепиться на нижнюю и верхнюю сторону блока", "1.8": "кнопка может крепиться на нижнюю и верхнюю сторону блока", "1.4": "появилась возможность блокировки повторителя"}, "редстоуновый_такт": "единица времени в Minecraft, соответствующая 0.1 секунды", "игровой_такт": "1/20 секунды"}, "references": ["https://ru.wikipedia.org/wiki/%D0%A1%D1%82%D1%80%D0%B5%D0%BB%D0%BA%D0%B0_%D0%9F%D0%B8%D1%80%D1%81%D0%B0", "https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%BA%D0%BE%D0%BD%D1%8B_%D0%B4%D0%B5_%D0%9C%D0%BE%D1%80%D0%B3%D0%B0%D0%BD%D0%B0", "https://programforyou.ru/calculators/postroenie-tablitci-istinnosti-sknf-sdnf", "https://ru.wikipedia.org/wiki/%D0%9E%D1%82%D1%80%D0%B8%D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F_%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D0%B0%D1%8F_%D1%81%D0%B2%D1%8F%D0%B7%D1%8C", "https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D0%B6%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F_%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D0%B0%D1%8F_%D1%81%D0%B2%D1%8F%D0%B7%D1%8C", "https://ru.wikipedia.org/wiki/%D0%A2%D1%80%D0%B8%D0%B3%D0%B3%D0%B5%D1%80", "https://ru.wikipedia.org/wiki/%D0%A8%D1%82%D1%80%D0%B8%D1%85_%D0%A8%D0%B5%D1%84%D1%84%D0%B5%D1%80%D0%B0", "https://minecraft.wiki/w/Redstone_circuit"]}