{"extracted_information": "Данный веб-контент содержит подробную информацию о методах оптимизации сцен Three.js для повышения производительности при сохранении высокого качества визуализации. Оптимизация охватывает планирование и выбор моделей, предварительную оптимизацию ассетов, оптимизацию сцен Three.js, физику, а также освещение и постобработку.", "specifications": {}, "pricing": {}, "features": [{"category": "Планирование и выбор моделей", "techniques": ["Использование моделей с различным уровнем детализации в зависимости от расстояния до камеры.", "Применение низкополигональных моделей (low-poly) для уменьшения количества обрабатываемых треугольников, снижая нагрузку на CPU и GPU.", "Выбор оптимизированных ассетов с низким количеством полигонов (например, на Sketchfab).", "Оптимизация размера текстур, предпочтение разрешений, кратных 2 (128, 256, ..., 1024) для эффективного управления памятью."]}, {"category": "Предварительная оптимизация ассетов (с использованием Blender)", "techniques": ["Просмотр каркаса моделей и удаление неиспользуемых частей в редакторе.", "Использование модификатора 'Decimate' в Blender для уменьшения количества полигонов при сохранении общей формы.", "Запекание текстур (texture baking) для предварительной отрисовки света и теней в текстуры для статических объектов и освещения (рекомендуется Simplebake или бесплатные альтернативы).", "Экспорт в форматы .glb или .gltf, предпочтительно .glb для включения всех текстур и модели в один файл.", "Сжатие текстур при экспорте из Blender или с использованием онлайн-инструментов (compresspng.com, compressjpeg.com).", "Использование `gltfjsx` для дальнейшего сжатия моделей и генерации React-компонентов (-S: упрощение сетки; -T: трансформация для веба, включая сжатие Draco, отсечение, изменение размера; -t: добавление TypeScript-определений), что позволило уменьшить размер ассета на 90% в демо."]}, {"category": "Оптимизация сцен Three.js", "techniques": ["Мониторинг производительности с помощью инструментов: r3f-perf (для react-three-fiber), stats.js (для vanilla Three.js), Spector.js (расширение Chrome/Firefox для WebGL, записывает draw calls), Chrome DevTools (анализ памяти, GPU, CPU).", "Настройка Canvas и Pixel Ratio (DPR): ограничение `window.devicePixelRatio` (например, до 1 для десктопов, 1.5 для мобильных устройств), динамическая подстройка DPR с помощью PerformanceMonitor в зависимости от FPS (например, снижение DPR на 20% или отключение постобработки).", "Отключение `antialias: false` на canvas для повышения производительности, особенно при низком DPR или использовании постобработки.", "Приостановка рендеринга, когда вкладка неактивна, путем динамического изменения `frameloop` canvas (установка на 'never' при `document.hidden`).", "Инстансинг: рендеринг большого количества объектов с одинаковой геометрией и материалами в один draw call для снижения нагрузки. Описан метод для объектов с разными текстурами путем синхронизации мировых трансформаций инстансированного меша с неинстансированными мешами, содержащими текстуры."]}, {"category": "Физика", "techniques": ["Использование простых форм (коробка, сфера) для коллайдеров вместо автоматической генерации движком (Rapier, react-three-rapier).", "Снижение частоты обновления физики для уменьшения вычислительной нагрузки (может изменить поведение симуляции).", "Реализация механизма перетаскивания (drag-and-drop) с сохранением физики: при клике объект становится статическим и программно обновляется DragControl, при отпускании возвращается к динамическому состоянию."]}, {"category": "Освещение и постобработка", "techniques": ["Минимизация использования динамического освещения, так как оно ресурсоемко.", "Использование карт окружения (environment maps) для достижения реалистичного освещения без значительного влияния на производительность (возможность использования только для освещения без отображения).", "Добавление статического или динамического освещения с помощью `Lightformer`.", "Применение эффектов постобработки (через react-postprocessing или postprocessing для vanilla Three.js): Tone mapping, Hue и saturation adjustments, Depth of field, N8AO Ambient Occlusion. Отмечена ресурсоемкость некоторых эффектов и возможность их динамического отключения/настройки при снижении производительности."]}], "statistics": {"demo_achievements": {"meshes": 27, "textures": 184, "shaders": 49, "triangles": "40k", "features": ["Physics simulations", "High-quality lighting", "Post-processing effects"], "asset_size": "2.1 MB"}}, "temporal_info": {}, "geographical_data": {}, "references": [{"name": "Blender", "url": "https://www.blender.org/"}, {"name": "Simplebake", "url": "https://blendermarket.com/products/simplebake---simple-pbr-and-other-baking-in-blender-2"}, {"name": "compresspng.com", "url": "https://compresspng.com/"}, {"name": "compressjpeg.com", "url": "https://compressjpeg.com/"}, {"name": "gltfjsx", "url": "https://github.com/pmndrs/gltfjsx"}, {"name": "r3f-perf", "url": "https://github.com/utsuboco/r3f-perf"}, {"name": "react-three-fiber", "url": "https://r3f.docs.pmnd.rs/getting-started/introduction"}, {"name": "stats.js", "url": "https://github.com/mrdoob/stats.js"}, {"name": "spector.js", "url": "https://github.com/BabylonJS/Spector.js"}, {"name": "MDN - window.devicePixelRatio", "url": "https://developer.mozilla.org/en-US/docs/Web/API/Window/devicePixelRatio"}, {"name": "PerformanceMonitor (drei docs)", "url": "https://drei.docs.pmnd.rs/performances/performance-monitor"}, {"name": "react-three-rapier", "url": "https://github.com/pmndrs/react-three-rapier"}, {"name": "DragControls (drei docs)", "url": "https://drei.docs.pmnd.rs/gizmos/drag-controls#dragcontrols"}, {"name": "DraggableRigidBody (GitHub)", "url": "https://github.com/niccolofanton/DraggableRigidBody"}, {"name": "Lightformer implementation guide by 0xca0a", "url": "https://x.com/0xca0a/status/1625177704323596305"}, {"name": "react-postprocessing", "url": "https://github.com/pmndrs/react-postprocessing"}, {"name": "postprocessing (vanilla Three.js)", "url": "https://github.com/pmndrs/postprocessing"}, {"name": "N8AO Ambient Occlusion by @N8Programs", "url": "https://x.com/N8Programs"}]}